In [4]:
import pandas as pd


# create a sample dataframe
data = {'Name': ['John', 'John', 'Jane', 'Jane'], 
        'Age': [30, 35, 25, 27], 
        'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']}
df = pd.DataFrame(data)

# group the dataframe by the 'Name' column and aggregate the data for each group
merged_df = df.groupby('Name').agg({'Age': 'first', 'City': ', '.join}).reset_index()

# rename the aggregated 'City' column to 'City_List' and drop the original 'City' column
merged_df = merged_df.rename(columns={'City': 'City_List'}).drop(columns='Age')

In [5]:
merged_df

   Name              City_List
0  Jane       Chicago, Houston
1  John  New York, Los Angeles